<template>
  <div id="home">
    <div class="nav">
      <a
          href="javascript:;"
          class="navList"
          v-for="(list, i) in navLists"
          :class="{ on : activeIndex == i }"
          :key="i"
          @click="changeNav(i)"
      >
        {{ list }}
      </a>
    </div>
    <Swipe></Swipe>
    <div class="entry">
      <a href="javascript:;" v-for="(item,i) in entryLists" :key="i">
        <div class="imgbox">
          <img :src="item.entryImg" alt="">
        </div>
        <span>{{item.entryName}}</span>
      </a>
    </div>
    <div class="newsList">
      <ul
        class="news"
        v-for="(item,i) in newsLists" :key="i"
        v-if="activeIndex == i"
      >
        <li v-for="(lists, k) in item" :key="k">{{ lists.title }}
          <p>{{ lists.time }}</p>
        </li>
      </ul>
    </div>
  </div>
</template>

<script>

  import Nav from "../pages/Nav";
  import HelloWorld from "./HelloWorld";
  import Swipe from "../pages/Swipe";

  export default {
    name: "Home",
    components: {Swipe, HelloWorld, Nav},
    data() {
      return {
        navLists: ["图片新闻", "公告通知", "简报资讯", "政策文件"],
        activeIndex: 0,
        entryLists:[
          {
            entryImg:require("../assets/nav/gou.png"),
            entryName:"我的项目"
          },
          {
            entryImg:require("../assets/nav/book.png"),
            entryName:"学习档案"
          },
          {
            entryImg:require("../assets/nav/answer.png"),
            entryName:"咨询答疑"
          },
          {
            entryImg:require("../assets/nav/play.png"),
            entryName:"直播课堂"
          }
        ],
        newsLists: [
          [
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            }
          ],
          [
            {
              title: '11111中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            }
          ],
          [
            {
              title: '222222222中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            }
          ],
          [
            {
              title: '333333333333333333中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            },
            {
              title: '中央“不忘初心、牢记使命”主题教育领导小组引发《关于第一批主题教育单位整改落实情况进行“回头看”的通知》',
              time: "11-05"
            }
          ],
        ],
      };
    },

    methods:{
      changeNav:function (i) {
        this.activeIndex = i;
      }
    }
  }
</script>

<style scoped>
  .nav {
    display: flex;
    font-size: 0.36rem;
  }

  .nav a {
    flex: 1;
    color: #2c3e50;
    text-decoration: none;
    padding-bottom: 0.1rem;
  }

  .nav a.on {
    color: #ff0e36;
    border-bottom: solid 2px #ff0e36;
  }

  .entry {
    display: flex;
    justify-content: space-around;
    align-items: center;
    margin: .2rem auto;
  }
  
  .entry .imgbox {
    width: 1.5rem;
    height: 1.5rem;
    background: #EF5357;
    border-radius: 50%;
    display: flex;
    justify-content: center;
    align-items: center;
  }
  .entry .imgbox img {
    width: 50%;
    height: 50%;
  }
  .entry a {
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
  }
  .entry a:nth-of-type(2) .imgbox{
    background: #9828CE;
  }
  .entry a:nth-of-type(3) .imgbox{
    background: #41D0BD;
  }
  .entry a:nth-of-type(4) .imgbox{
    background: #64A9DD;
  }
.news  {
  font-size: .24rem;
  padding: 0 .3rem 2rem;
}
  .news li {
    margin: .2rem;
  }
  .news li p {
    color: #ccc;
    text-align: right;
  }
</style>
